foldvarid93/STM32F446RE_ExtensionBoard/03_Software/01_446RE_STemWin_ExtensionBoard/RemoteXY/remotexy.c
  private:  
  void searchStartByte (uint16_t pos) {
    uint8_t *p, *kp;
    uint16_t i;
    uint16_t ri = receiveIndex;
    p=receiveBuffer+pos;
    receiveCRC=initCRC ();
    for (i=pos; i<ri; i++) {
      if (*p==REMOTEXY_PACKAGE_START_BYTE) {      
        kp=receiveBuffer;
        receiveIndex=receiveIndex-i;
        while (i++<ri) {
          updateCRC (&receiveCRC, *p);              
          *(kp++)=*(p++);
        }
        return;
      }
      p++;
    }        
    receiveIndex=0;
  }  
  
  uint8_t handleReceivePackage () {
    uint8_t command;
    uint16_t i;
    uint16_t length;
    uint8_t *p, *kp;
       
    length = receiveBuffer[1]|(receiveBuffer[2]>>8); 
    length-=6;
    command = receiveBuffer[3];
    switch (command) {  
      case 0x00:  
        uint8_t available;
        if (length==0) {
          if (*accessPassword==0) available=1;
          else available=0;
        }
        else {
          uint8_t ch;
          available = 1;
          p = receiveBuffer+4;
          kp = accessPassword; 
          while (true) {
            ch=*kp++;
            if (ch!=*p++) available=0;
            if (!ch) break;
          }                               
        } 
        if (available!=0) {
          sendPackage (command, conf, confLength,  1);
          *connect_flag = 1;
        }
        else {
          uint8_t buf[4];
          p = buf;
          kp = conf;         
          i=confVersion>=5?3:2;
          length = i+1;
          while (i--) *p++ = getConfByte(kp++);
          *p++ = 0xf0;
          sendPackage (command, buf, length,  0);
        }          
        break;   
      case 0x40:  
        inputVarNeedSend = 0;
        sendPackage (command, var, inputLength+outputLength, 0); 
        break;   
      case 0x80:  
        if ((length==inputLength) && (inputVarNeedSend==0)) {
          p=receiveBuffer+4;
          kp=var;
          i= inputLength;
          while (i--) *kp++=*p++;
        }
        sendPackage (command, 0, 0, 0);
        break;   
      case 0xC0:  
        if (inputVarNeedSend!=0) command |= 0x01;
        sendPackage (command, var+inputLength, outputLength, 0);
        break;   
#if defined(REMOTEXY_CLOUD)  
      case 0x10: // echo
        sendPackage (command, 0, 0, 0);
        break;   
      case 0x11:
        if (cloudState==REMOTEXY_CLOUD_STATE_REGISTRATION) {
          setCloudState (REMOTEXY_CLOUD_STATE_WORKING);
        }
        break;   
#endif //REMOTEXY_CLOUD       
      default:
        return 0; 
    }  
    
    wireTimeOut=millis();    
#if defined(REMOTEXY_CLOUD)  
    if (cloudState==REMOTEXY_CLOUD_STATE_WORKING) {
      cloudTimeOut=millis();
    }
#endif //REMOTEXY_CLOUD       
    return 1;
  }
  
  
///////////////////////////////////////////////////////////////////////////////
// PUBLIC DOCUMENTED FUNCTIONS
  
  public:
  uint8_t isConnected () {
    return *connect_flag;
  }
  
  // transmit the input vars to smartphone, while input variables are transmitted the output variables are not sent
  public:
  void sendInputVariables () {
    inputVarNeedSend = 1;
  }

  //check if input variables were sent, return 1 if sent
  public:
  uint8_t didSendInputVariables () {
    if (inputVarNeedSend==0) return 1;
    else return 0;
  }

///////////////////////////////////////////////////////////////////////////////
// CLOUD SUPPORT 


#if defined(REMOTEXY_CLOUD)  
  protected:
  char *cloudServer;
  uint16_t cloudPort;
  uint8_t cloudRegistPackage[38];
  uint8_t cloudState;   
  uint32_t cloudTimeOut;


  virtual int8_t connectServerCloud (char * _cloudServer, uint16_t _cloudPort) {return 0;};

  public:
  void initCloud (const char * _cloudServer, uint16_t _cloudPort, const char * _cloudToken) {
    cloudServer = (char *) _cloudServer;
    cloudPort = _cloudPort;
    
    uint8_t i;
    uint8_t *p = cloudRegistPackage;
    *p++ = getConfByte(conf+0);
    *p++ = 0;    
    for (i=0; i<32; i++) {
      if (*_cloudToken==0) *(p++)=0;
      else *(p++)=*(_cloudToken++);
    }
    uint16_t *len = (uint16_t*)p;
    *len = outputLength + inputLength;
    if (confLength>*len) *len = confLength;   
    *len += 6+1;    
    len = (uint16_t*)(p+2);     
    *len = receiveBufferLength;  
    
    cloudState = REMOTEXY_CLOUD_STATE_STOP;
  }
  
  public:
  void startCloudConnection () {
    if (cloudState<REMOTEXY_CLOUD_STATE_CONNECTION) {
      setCloudState (REMOTEXY_CLOUD_STATE_CONNECTION);
    }
  }  
  
  public:
  void stopCloud () {
    closeConnection ();
    resetWire ();
    if (cloudState<REMOTEXY_CLOUD_STATE_CONNECTION) return;
#if defined(REMOTEXY__DEBUGLOGS)
    DEBUGLOGS_write("Cloud server disconnected");
#endif
    setCloudState (REMOTEXY_CLOUD_STATE_WAIT_RECONNECT);
  }
  
  private:
  void setCloudState (uint8_t state) {
    cloudState = state;
    cloudTimeOut = millis(); 
#if defined(REMOTEXY__DEBUGLOGS)
    switch (state) {
      case REMOTEXY_CLOUD_STATE_WAIT_RECONNECT: 
        DEBUGLOGS_write("Waiting to reconnect to the cloud server");
        break;
      case REMOTEXY_CLOUD_STATE_WAIT_NEXT_TRY: 
        DEBUGLOGS_write("Waiting to next try to connect to the cloud server");
        break;
      case REMOTEXY_CLOUD_STATE_CONNECTION: 
        DEBUGLOGS_write("Started connecting to cloud server");
        break;
      case REMOTEXY_CLOUD_STATE_REGISTRATION: 
        DEBUGLOGS_write("Waiting for registration on cloud server");
        break;
      case REMOTEXY_CLOUD_STATE_WORKING: 
        DEBUGLOGS_write("Connect to the cloud server successfully");
        break;
      default:
        DEBUGLOGS_write("Unknown cloud state ");
        REMOTEXY__DEBUGLOGS.print(cloudState);
        break;
    }
#endif
  }
  
  private:
  void handlerCloud () {
    int8_t res;
    if (!moduleRunning) return;
    switch (cloudState) {
      
      case REMOTEXY_CLOUD_STATE_WAIT_RECONNECT:  
        if (millis() - cloudTimeOut > REMOTEXY_CLOUD_RECONNECT_TIMEOUT)
          setCloudState (REMOTEXY_CLOUD_STATE_CONNECTION);          
        break;
        
      case REMOTEXY_CLOUD_STATE_WAIT_NEXT_TRY:  
        if (millis() - cloudTimeOut > REMOTEXY_CLOUD_RETRY_TIMEOUT) 
          setCloudState (REMOTEXY_CLOUD_STATE_CONNECTION);            
        break;
        
      case REMOTEXY_CLOUD_STATE_CONNECTION:  
        res = connectServerCloud (cloudServer, cloudPort);
        if (res == 1) {          
          setCloudState (REMOTEXY_CLOUD_STATE_REGISTRATION);   
          sendPackage (0x11, cloudRegistPackage, 38, 0);
        }
        else if (res == 0) {
#if defined(REMOTEXY__DEBUGLOGS)
          DEBUGLOGS_write("Cloud server connection error");          
#endif         
          setCloudState (REMOTEXY_CLOUD_STATE_WAIT_RECONNECT); 
        }
        else {
          setCloudState (REMOTEXY_CLOUD_STATE_WAIT_NEXT_TRY); 
        }
        break;
        
