foldvarid93/STM32F446RE_ExtensionBoard/03_Software/01_446RE_STemWin_ExtensionBoard/RemoteXY/remotexy.c
      case REMOTEXY_CLOUD_STATE_REGISTRATION:  
        if (millis() - cloudTimeOut > REMOTEXY_CLOUD_CONNECT_TIMEOUT) 
          stopCloud ();
        break;
        
      case REMOTEXY_CLOUD_STATE_WORKING:  
        if (millis() - cloudTimeOut > REMOTEXY_CLOUD_ECHO_TIMEOUT) 
          stopCloud ();
        break;
    }
  } 
  
///////////////////////////////////////////////////////////////////////////////
// PUBLIC DOCUMENTED FUNCTIONS OF CLOUD
  
  public:
  uint8_t isCloudConnected () {
    return (cloudState==REMOTEXY_CLOUD_STATE_WORKING ? 1:0);
  }
  
  
#endif //REMOTEXY_CLOUD

///////////////////////////////////////////////////////////////////////////////
// DEBUG FUNCTIONS

#if defined(REMOTEXY__DEBUGLOGS)
  uint8_t debug_flags;
  uint8_t debug_hexcounter;
  
  public:
  void DEBUGLOGS_init () {
    debug_flags=0;
    REMOTEXY__DEBUGLOGS.begin (REMOTEXY__DEBUGLOGS_SPEED);
    REMOTEXY__DEBUGLOGS.println();
  }

  public:
  void DEBUGLOGS_writeTime () {
    uint32_t d = millis();
    char s[15];
    sprintf (s, "[%5ld.%03d] ",(long)(d/1000), (int)(d%1000));     
    REMOTEXY__DEBUGLOGS.println ();    
    REMOTEXY__DEBUGLOGS.print (s);
  }
  
  public:
  void DEBUGLOGS_write (const char *s) {
    debug_flags = 0;
    DEBUGLOGS_writeTime (); 
    REMOTEXY__DEBUGLOGS.print(s);
  }
  
  public:
  void DEBUGLOGS_writeInput (char *s) {
    if ((debug_flags & 0x01)==0) {
      DEBUGLOGS_writeTime ();
      REMOTEXY__DEBUGLOGS.print("<- ");
    }
    debug_flags = 0x01;   
    REMOTEXY__DEBUGLOGS.print(s);
  }

  public:
  void DEBUGLOGS_writeOutput (char *s) {
    if ((debug_flags & 0x02)==0) {
      DEBUGLOGS_writeTime ();
      REMOTEXY__DEBUGLOGS.print("-> ");
    }
    debug_flags = 0x02;   
    REMOTEXY__DEBUGLOGS.print(s);
  }

  public:
  void DEBUGLOGS_writeInputHex (uint8_t b) {
    if ((debug_flags & 0x01)==0) {
      DEBUGLOGS_writeTime ();
      REMOTEXY__DEBUGLOGS.print("<-");
      debug_hexcounter=0;
    }
    debug_flags = 0x01;   
    DEBUGLOGS_writeHex (b);
  }

  public:
  void DEBUGLOGS_writeOutputHex (uint8_t b) {
    if ((debug_flags & 0x02)==0) {
      DEBUGLOGS_writeTime ();
      REMOTEXY__DEBUGLOGS.print("->");
      debug_hexcounter=0;
    }
    debug_flags = 0x02;
    DEBUGLOGS_writeHex (b);
  }
  
  public:
  void DEBUGLOGS_writeInputChar (char s) {
    if ((debug_flags & 0x01)==0) {
      DEBUGLOGS_writeTime ();
      REMOTEXY__DEBUGLOGS.print("<- ");
    }
    debug_flags = 0x01;   
    REMOTEXY__DEBUGLOGS.print(s);
  }

  public:
  void DEBUGLOGS_writeInputNewString () {
    debug_flags = 0;
  }
  
  public:
  void DEBUGLOGS_writeHex (uint8_t b) {
    debug_hexcounter++;
    if (debug_hexcounter>16) {
      REMOTEXY__DEBUGLOGS.println();
      REMOTEXY__DEBUGLOGS.print("              ");
      debug_hexcounter=1;
    }
    REMOTEXY__DEBUGLOGS.print(' ');
    REMOTEXY__DEBUGLOGS.print(b>>4, HEX); 
    REMOTEXY__DEBUGLOGS.print(b&0x0f, HEX); 
    
    
    
  }  
  
#endif //REMOTEXY__DEBUGLOGS 
   
};

#endif //_REMOTEXY_API_H_

